000010*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000020*サンプルプログラム
000030*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID.                 DYNTEST.
000060*AUTHOR.                     KENJI KIMURA.
000070 ENVIRONMENT DIVISION.
000080* INPUT-OUTPUT SECTION.
000090* FILE-CONTROL.
000100*    入力ファイル
000110**ACMFILE
000120* SELECT INP-FILE ASSIGN TO "dbtests2"
000130*        ORGANIZATION IS INDEXED
000140*        ACCESS MODE  IS DYNAMIC
000150*        RECORD KEY   IS I-ID.
000160 DATA DIVISION.
000170* FILE SECTION.
000180*入力ファイル
000190* FD  INP-FILE.
000200* COPY "I_RECORD2.cbl".
000210 WORKING-STORAGE SECTION.
000220*ACM Generated Contraints
000230 COPY "ACMCONSTS.CBL".
000240*ACM Genrated File Record
000250 COPY "I_RECORD2.cbl".
000260 01  SOME-AREA.
000270     05  I-COUNTER           PIC 9(05).
000280     05  O-COUNTER           PIC 9(05).
000290     05  END-FLG             PIC 9(01)  VALUE  ZERO.
000300*
000310 COPY "SCR_RECORD.cbl".
000320*画面
000330 SCREEN SECTION.
000340*
000350 COPY "DSP_RECORD.cbl".
000360*
000370 PROCEDURE DIVISION.
000380*主処理節
000390     CALL "initializeSessionEnv" USING ACM-STATUS-ALL.
000400     PERFORM   INIT.
000410     PERFORM   FL-OPEN.
000420*    入力ファイルが終了するまで繰り返し
000430     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
000440        DISPLAY   DSP-RECORD2
000450        ACCEPT    DSP-RECORD1
000460        EVALUATE  SCR-PROC
000470        WHEN  0
000480*           終了
000490            MOVE  1  TO  END-FLG
000500        WHEN  1
000510*           追加
000520            PERFORM  OUT-WRITE
000530        WHEN  2
000540*           読み込み
000550            PERFORM  INP-READ
000560        WHEN  3
000570*           更新
000580            PERFORM  OUT-REWRITE
000590        WHEN  9
000600*           削除
000610            PERFORM  OUT-DELETE
000620        END-EVALUATE
000630     END-PERFORM.
000640     PERFORM   FL-CLOSE.
000650     PERFORM   TERM.
000660     CALL  "terminateSession" USING ACM-STATUS-ALL.
000670     STOP RUN.
000680*開始処理
000690 INIT SECTION.
000700     DISPLAY   "PROGRAM STARTING.".
000710     EXIT.
000720*ファイルを開く節
000730 FL-OPEN SECTION.
000740*     OPEN   I-O  INP-FILE.
000750     MOVE "dbtests2" TO ACM-FILE-IDENT.
000760     CALL "assignACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
000770     CALL "openACMFile"   USING ACM-FILE-IDENT
000780                                ACM-OPENMODE-IO
000790                                ACM-ACCESSMODE-DYN
000800                                ACM-STATUS-ALL.
000810     EXIT.
000820*入力処理節
000830 INP-READ SECTION.
000840     MOVE SCR-ID  TO  I-ID.
000850*     READ INP-FILE 
000860*     INVALID KEY
000870*         DISPLAY  "CANT FIND"
000880*         MOVE  1  TO  END-FLG
000890*     END-READ.
000900     MOVE "dbtests2" TO ACM-FILE-IDENT.
000910     MOVE I-RECORD TO ACM-RECORD.
000920     CALL "moveReadACMRecord" USING 
000930                                ACM-FILE-IDENT
000940                                ACM-RECORD
000950                                ACM-STATUS-ALL.
000960     IF  ACM-STATUS-CODE = "00"
000970         MOVE ACM-RECORD TO I-RECORD
000980     END-IF.
000990     IF ACM-STATUS-CODE = "23"
001000         DISPLAY  "CANT FIND"
001010         MOVE  1  TO  END-FLG
001020     END-IF.
001030     IF  END-FLG  =  ZERO
001040*        終端に達していなければカウンターを増分
001050         ADD  1              TO  I-COUNTER
001060         PERFORM REC2SCR
001070     END-IF.
001080     EXIT.
001090*出力処理節
001100 OUT-WRITE SECTION.
001110     PERFORM SCR2REC.
001120* ACM Generated Write
001130*     WRITE I-RECORD
001140*     INVALID KEY
001150*         MOVE  1  TO  END-FLG
001160*     NOT INVALID KEY
001170*         INITIALIZE   SCR-RECORD
001180*     END-WRITE.
001190     MOVE "dbtests2" TO ACM-FILE-IDENT.
001200     MOVE I-RECORD TO ACM-RECORD
001210     CALL "writeACMRecord" USING ACM-FILE-IDENT
001220                                 ACM-RECORD
001230                                 ACM-STATUS-ALL.
001240     IF ACM-STATUS-CODE = "22"
001250         MOVE  1  TO  END-FLG
001260     ELSE
001270         INITIALIZE   SCR-RECORD
001280     END-IF.
001290     ADD  1                  TO  O-COUNTER.
001300     EXIT.
001310*出力処理節
001320 OUT-REWRITE SECTION.
001330     PERFORM SCR2REC.
001340* ACM Generated Write
001350*     REWRITE I-RECORD
001360*     INVALID  KEY
001370*         MOVE  1  TO  END-FLG
001380*     NOT INVALID KEY
001390*         INITIALIZE   SCR-RECORD
001400*     END-REWRITE.
001410     MOVE "dbtests2" TO ACM-FILE-IDENT.
001420     MOVE I-RECORD TO ACM-RECORD
001430     CALL "rewriteACMRecord" USING ACM-FILE-IDENT
001440                                   ACM-RECORD
001450                                   ACM-STATUS-ALL.
001460     IF ACM-STATUS-CODE = "23"
001470         MOVE  1  TO  END-FLG
001480     ELSE
001490         INITIALIZE   SCR-RECORD
001500     END-IF.
001510     ADD  1                  TO  O-COUNTER.
001520     EXIT.
001530*出力処理節
001540 OUT-DELETE SECTION.
001550     PERFORM SCR2REC.
001560*     DELETE INP-FILE
001570* ACM Generated Write
001580*     DELETE INP-FILE
001590*     INVALID  KEY
001600*         MOVE  1  TO  END-FLG
001610*     NOT INVALID KEY
001620*         INITIALIZE   SCR-RECORD
001630*     END-DELETE.
001640     MOVE "dbtests2" TO ACM-FILE-IDENT.
001650     MOVE I-RECORD TO ACM-RECORD
001660     CALL "deleteACMRecord" USING ACM-FILE-IDENT
001670                                  ACM-RECORD
001680                                  ACM-STATUS-ALL.
001690     IF ACM-STATUS-CODE = "23"
001700         MOVE  1  TO  END-FLG
001710     ELSE
001720         INITIALIZE   SCR-RECORD
001730     END-IF.
001740     ADD  1                  TO  O-COUNTER.
001750     EXIT.
001760*レコード転送節
001770 REC2SCR SECTION.
001780     MOVE I-ID            TO SCR-ID.
001790     MOVE I-CD            TO SCR-CD.
001800     MOVE I-NIHONGO       TO SCR-NIHONGO.
001810*    MOVE I-SEISU         TO SCR-SEISU.
001820     IF  I-SEISU  >  ZERO
001830         MOVE I-SEISU     TO SCR-SEISU
001840         MOVE ZERO        TO SCR-SEISU-FLG
001850     ELSE
001860         COMPUTE SCR-SEISU = I-SEISU * (-1)
001870         MOVE    1        TO SCR-SEISU-FLG
001880     END-IF
001890     MOVE I-HIZUKE-YYYY   TO SCR-HIZUKE-YYYY.
001900     MOVE I-HIZUKE-MM     TO SCR-HIZUKE-MM.
001910     MOVE I-HIZUKE-DD     TO SCR-HIZUKE-DD.
001920     MOVE I-JIKOKU-HH     TO SCR-JIKOKU-HH.
001930     MOVE I-JIKOKU-MM     TO SCR-JIKOKU-MM.
001940     MOVE I-JIKOKU-SS     TO SCR-JIKOKU-SS.
001950*    MOVE I-FUDOU         TO SCR-FUDOU.
001960     EXIT.
001970*レコード転送節
001980 SCR2REC SECTION.
001990     MOVE SCR-ID          TO I-ID.
002000     MOVE SCR-CD          TO I-CD.
002010     MOVE SCR-NIHONGO     TO I-NIHONGO.
002020*    MOVE SCR-SEISU       TO I-SEISU.
002030     IF  SCR-SEISU-FLG  = ZERO
002040         MOVE SCR-SEISU       TO I-SEISU
002050     ELSE
002060         COMPUTE  I-SEISU  = SCR-SEISU * (-1)
002070     END-IF
002080     MOVE SCR-HIZUKE-YYYY TO I-HIZUKE-YYYY.
002090     MOVE SCR-HIZUKE-MM   TO I-HIZUKE-MM.
002100     MOVE SCR-HIZUKE-DD   TO I-HIZUKE-DD.
002110     MOVE SCR-JIKOKU-HH   TO I-JIKOKU-HH.
002120     MOVE SCR-JIKOKU-MM   TO I-JIKOKU-MM.
002130     MOVE SCR-JIKOKU-SS   TO I-JIKOKU-SS.
002140*    MOVE SCR-FUDOU       TO I-FUDOU.
002150     EXIT.
002160*ファイルを閉じる節
002170 FL-CLOSE SECTION.
002180*     CLOSE  INP-FILE.
002190     MOVE "dbtests2" TO ACM-FILE-IDENT.
002200     CALL "closeACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
002210     EXIT.
002220*終了処理
002230 TERM SECTION.
002240     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
002250     DISPLAY   "INPUT-COUNT:" I-COUNTER.
002260     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
002270     EXIT.
002280
