000010*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000020*サンプルプログラム
000030*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000040 IDENTIFICATION              DIVISION.
000050 PROGRAM-ID.                 IDXTEST.
000060*AUTHOR.                     KENJI KIMURA.
000070 ENVIRONMENT                 DIVISION.
000080 CONFIGURATION               SECTION.
000090* INPUT-OUTPUT                SECTION.
000100* FILE-CONTROL.
000110*    入力ファイル
000120**ACMFILE
000130*     SELECT INP-FILE ASSIGN TO "dbtests2"
000140*       ORGANIZATION IS INDEXED
000150*       ACCESS MODE     DYNAMIC
000160*       RECORD KEY   IS I-ID
000170*       ALTERNATE RECORD KEY IS I-SEISU.  
000180 DATA                        DIVISION.
000190* FILE                        SECTION.
000200*入力ファイル
000210* FD  INP-FILE.
000220* COPY "I_RECORD.cbl".
000230 WORKING-STORAGE             SECTION.
000240*ACM Generated Contraints
000250 COPY "ACMCONSTS.CBL".
000260*ACM Genrated File Record
000270 COPY "I_RECORD.cbl".
000280 01  SOME-AREA.
000290     05  I-COUNTER           PIC 9(05).
000300     05  O-COUNTER           PIC 9(05).
000310     05  END-FLG             PIC 9(01)  VALUE  ZERO.
000320 PROCEDURE                   DIVISION.
000330*主処理節
000340     CALL "initializeSessionEnv" USING ACM-STATUS-ALL.
000350     PERFORM   INIT.
000360     PERFORM   FL-OPEN.
000370     PERFORM  INP-READ.
000380*    入力ファイルが終了するまで繰り返し
000390     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
000400*                 OR  I-COUNTER     > 10000
000410        PERFORM  OUT-WRITE
000420        PERFORM  INP-READ
000430     END-PERFORM.
000440     PERFORM   FL-CLOSE.
000450     PERFORM   TERM.
000460     CALL  "terminateSession" USING ACM-STATUS-ALL.
000470     STOP RUN.
000480*開始処理
000490 INIT                        SECTION.
000500     DISPLAY   "PROGRAM STARTING.".
000510     EXIT.
000520*ファイルを開く節
000530 FL-OPEN                     SECTION.
000540*     OPEN   INPUT  INP-FILE.
000550     MOVE "dbtests2" TO ACM-FILE-IDENT.
000560     CALL "assignACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
000570     CALL "openACMFile"   USING ACM-FILE-IDENT
000580                                ACM-OPENMODE-INPUT
000590                                ACM-ACCESSMODE-DYN
000600                                ACM-STATUS-ALL.
000610     MOVE  200    TO  I-SEISU.
000620*     START INP-FILE
000630*       KEY IS = I-SEISU
000640*     INVALID KEY MOVE 10001   TO  I-COUNTER
000650*     END-START.
000660     MOVE "dbtests2" TO ACM-FILE-IDENT.
000670     MOVE   IS-EQUAL-TO   TO ACM-START-MODE.
000680     MOVE I-RECORD TO ACM-RECORD.
000690     MOVE  "I-SEISU"  TO  ACM-INDEX-NAME.
000700     CALL "startACMRecordWith" USING ACM-FILE-IDENT
000710                                ACM-RECORD
000720                                ACM-INDEX-NAME
000730                                ACM-START-MODE
000740                                ACM-STATUS-ALL.
000750     IF ACM-STATUS-CODE = "23"
000760         MOVE 10001   TO  I-COUNTER
000770     END-IF.
000780     EXIT.
000790*入力処理節
000800 INP-READ                    SECTION.
000810*     READ INP-FILE NEXT
000820*       AT END  MOVE 1 TO END-FLG
000830*     END-READ.
000840     MOVE "dbtests2" TO ACM-FILE-IDENT.
000850     CALL "readNextACMRecord" USING 
000860                                ACM-FILE-IDENT
000870                                ACM-RECORD
000880                                ACM-STATUS-ALL.
000890     IF  ACM-STATUS-CODE = "00"
000900         MOVE ACM-RECORD TO I-RECORD
000910     END-IF.
000920     IF ACM-STATUS-CODE = "10"
000930         MOVE 1 TO END-FLG
000940     END-IF.
000950     IF  END-FLG  =  ZERO
000960*        終端に達していなければカウンターを増分
000970         ADD  1              TO  I-COUNTER
000980     END-IF.
000990     EXIT.
001000*出力処理節
001010 OUT-WRITE                   SECTION.
001020     DISPLAY  I-RECORD.
001030     ADD  1                  TO  O-COUNTER.
001040     EXIT.
001050*ファイルを閉じる節
001060 FL-CLOSE                    SECTION.
001070*     CLOSE  INP-FILE.
001080     MOVE "dbtests2" TO ACM-FILE-IDENT.
001090     CALL "closeACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
001100     EXIT.
001110*終了処理
001120 TERM                        SECTION.
001130     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
001140     DISPLAY   "INPUT-COUNT:" I-COUNTER.
001150     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
001160     EXIT.
