000010*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000020*サンプルプログラム
000030*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000040 IDENTIFICATION              DIVISION.
000050 PROGRAM-ID.                 WRTTEST.
000060*AUTHOR.                     KENJI KIMURA.
000070 ENVIRONMENT                 DIVISION.
000080 CONFIGURATION               SECTION.
000090* INPUT-OUTPUT                SECTION.
000100* FILE-CONTROL.
000110*    入力ファイル
000120**ACMFILE
000130*     SELECT OUT-FILE ASSIGN TO "dbtests2"
000140*       ORGANIZATION LINE SEQUENTIAL.
000150 DATA                        DIVISION.
000160* FILE                        SECTION.
000170*入力ファイル
000180* FD  OUT-FILE.
000190*     COPY "O_RECORD2.cbl".
000200 WORKING-STORAGE             SECTION.
000210*ACM Generated Contraints
000220 COPY "ACMCONSTS.CBL".
000230*ACM Genrated File Record
000240     COPY "O_RECORD2.cbl".
000250 01  SOME-AREA.
000260     05  I-COUNTER           PIC 9(05).
000270     05  O-COUNTER           PIC 9(05).
000280     05  END-FLG             PIC 9(01)  VALUE  ZERO.
000290     05  W-COUNTER           PIC S9(05).
000300 01  WORK-AREA.
000310     05  W-A                 PIC S9(09).
000320     05  W-B                 PIC S9(09).
000330     05  W-C                 PIC S9(09).
000340     05  W-D                 PIC S9(09).
000350     05  W-EF.
000360       07  W-E               PIC 9(04).
000370       07  FILLER            PIC X(01)  VALUE  ".".
000380       07  W-F               PIC 9(03).
000390 PROCEDURE                   DIVISION.
000400*主処理節
000410     CALL "initializeSessionEnv" USING ACM-STATUS-ALL.
000420     PERFORM   INIT.
000430     PERFORM   FL-OPEN.
000440     PERFORM   OUT-EDIT.
000450*    入力ファイルが終了するまで繰り返し
000460     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
000470        PERFORM  OUT-WRITE
000480        PERFORM  OUT-EDIT
000490     END-PERFORM.
000500     PERFORM   FL-CLOSE.
000510     PERFORM   TERM.
000520     CALL  "terminateSession" USING ACM-STATUS-ALL.
000530     STOP RUN.
000540*開始処理
000550 INIT                        SECTION.
000560     DISPLAY   "PROGRAM STARTING.".
000570     MOVE  -5000  TO  W-COUNTER.
000580     MOVE  0      TO  I-COUNTER.
000590     EXIT.
000600*ファイルを開く節
000610 FL-OPEN                     SECTION.
000620*     OPEN   OUTPUT  OUT-FILE.
000630     MOVE "dbtests2" TO ACM-FILE-IDENT.
000640     CALL "assignACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
000650     CALL "openACMFile"   USING ACM-FILE-IDENT
000660                                ACM-OPENMODE-OUTPUT
000670                                ACM-ACCESSMODE-SEQ
000680                                ACM-STATUS-ALL.
000690     EXIT.
000700*入力処理節
000710 OUT-EDIT                    SECTION.
000720     ADD  1              TO  I-COUNTER.
000730     ADD  1              TO  W-COUNTER.
000740*    編集の本体
000750     MOVE I-COUNTER      TO  O-ID.
000760     MOVE I-COUNTER      TO  O-CD.
000770     MOVE I-COUNTER      TO  O-NIHONGO.
000780     MOVE W-COUNTER      TO  O-SEISU.
000790     COMPUTE  W-A  =  I-COUNTER  +  12000.
000800     DIVIDE  W-A  BY  2001  GIVING  W-C
000810                         REMAINDER  O-HIZUKE-YYYY.
000820     ADD     1000        TO  O-HIZUKE-YYYY.
000830     DIVIDE  W-A  BY  12    GIVING  W-C
000840                         REMAINDER  O-HIZUKE-MM.
000850     ADD     1           TO  O-HIZUKE-MM.
000860     DIVIDE  W-A  BY  28    GIVING  W-C
000870                         REMAINDER  O-HIZUKE-DD.
000880     ADD     1           TO  O-HIZUKE-DD.
000890     DIVIDE  W-A  BY  23    GIVING  W-C
000900                         REMAINDER  O-JIKOKU-HH.
000910     ADD     1           TO  O-JIKOKU-HH.
000920     DIVIDE  W-A  BY  59    GIVING  W-C
000930                         REMAINDER  O-JIKOKU-MM.
000940     ADD     1           TO  O-JIKOKU-MM.
000950     DIVIDE  W-A  BY  59    GIVING  W-C
000960                         REMAINDER  O-JIKOKU-SS.
000970     ADD     1           TO  O-JIKOKU-SS.
000980     COMPUTE  O-FUDOU  =  W-COUNTER  /  1000.
000990     IF  I-COUNTER  >  10000
001000*        終端に達していなければカウンターを増分
001010         MOVE  1         TO  END-FLG
001020     END-IF.
001030     EXIT.
001040*出力処理節
001050 OUT-WRITE                   SECTION.
001060* ACM Generated Write
001070*     WRITE  O-RECORD.
001080     MOVE "dbtests2" TO ACM-FILE-IDENT.
001090     MOVE O-RECORD TO ACM-RECORD
001100     CALL "writeACMRecord" USING ACM-FILE-IDENT
001110                                 ACM-RECORD
001120                                 ACM-STATUS-ALL.
001130     ADD  1                  TO  O-COUNTER.
001140     EXIT.
001150*ファイルを閉じる節
001160 FL-CLOSE                    SECTION.
001170*     CLOSE  OUT-FILE.
001180     MOVE "dbtests2" TO ACM-FILE-IDENT.
001190     CALL "closeACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
001200     EXIT.
001210*終了処理
001220 TERM                        SECTION.
001230     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
001240     DISPLAY   "OUTUT-COUNT:" I-COUNTER.
001250     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
001260     EXIT.
