000010*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000020*サンプルプログラム
000030*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000040 IDENTIFICATION              DIVISION.
000050 PROGRAM-ID.                 STTTEST.
000060*AUTHOR.                     KENJI KIMURA.
000070 ENVIRONMENT                 DIVISION.
000080 CONFIGURATION               SECTION.
000090* INPUT-OUTPUT                SECTION.
000100* FILE-CONTROL.
000110*    入力ファイル
000120**ACMFILE
000130*     SELECT INP-FILE ASSIGN TO "dbtests"
000140*       ORGANIZATION IS INDEXED
000150*       ACCESS MODE     DYNAMIC
000160*       RECORD KEY   IS I-ID.
000170 DATA                        DIVISION.
000180* FILE                        SECTION.
000190*入力ファイル
000200* FD  INP-FILE.
000210* COPY "I_RECORD.cbl".
000220 WORKING-STORAGE             SECTION.
000230*ACM Generated Contraints
000240 COPY "ACMCONSTS.CBL".
000250*ACM Genrated File Record
000260 COPY "I_RECORD.cbl".
000270 01  SOME-AREA.
000280     05  I-COUNTER           PIC 9(05).
000290     05  O-COUNTER           PIC 9(05).
000300     05  END-FLG             PIC 9(01)  VALUE  ZERO.
000310 PROCEDURE                   DIVISION.
000320*主処理節
000330     CALL "initializeJNISessionEnv" USING ACM-STATUS-ALL.
000340     PERFORM   INIT.
000350     PERFORM   FL-OPEN.
000360     PERFORM  INP-READ.
000370*    入力ファイルが終了するまで繰り返し
000380     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
000390*                 OR  I-COUNTER     > 10000
000400        PERFORM  OUT-WRITE
000410        PERFORM  INP-READ
000420     END-PERFORM.
000430     PERFORM   FL-CLOSE.
000440     PERFORM   TERM.
000450     CALL  "terminateJNISession" USING ACM-STATUS-ALL.
000460     STOP RUN.
000470*開始処理
000480 INIT                        SECTION.
000490     DISPLAY   "PROGRAM STARTING.".
000500     EXIT.
000510*ファイルを開く節
000520 FL-OPEN                     SECTION.
000530*     OPEN   INPUT  INP-FILE.
000540     MOVE "dbtests" TO ACM-FILE-IDENT.
000550     CALL "assignJNIFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
000560     CALL "openJNIFile"   USING ACM-FILE-IDENT
000570                                ACM-OPENMODE-INPUT
000580                                ACM-ACCESSMODE-DYN
000590                                ACM-STATUS-ALL.
000600     MOVE  5000    TO  I-ID.
000610*     START INP-FILE
000620*       KEY IS = I-ID
000630*     INVALID KEY MOVE 10001   TO  I-COUNTER
000640*     END-START.
000650     MOVE "dbtests" TO ACM-FILE-IDENT.
000660     MOVE   IS-EQUAL-TO   TO ACM-START-MODE.
000670     MOVE I-RECORD TO ACM-RECORD.
000680     MOVE  "I-ID"  TO  ACM-INDEX-NAME.
000690     CALL "startJNIRecordWith" USING ACM-FILE-IDENT
000700                                ACM-RECORD
000710                                ACM-INDEX-NAME
000720                                ACM-START-MODE
000730                                ACM-STATUS-ALL.
000740     IF ACM-STATUS-CODE = "23"
000750         MOVE 10001   TO  I-COUNTER
000760     END-IF.
000770     EXIT.
000780*入力処理節
000790 INP-READ                    SECTION.
000800*     READ INP-FILE NEXT
000810*       AT END  MOVE 1 TO END-FLG
000820*     END-READ.
000830     MOVE "dbtests" TO ACM-FILE-IDENT.
000840     CALL "readNextJNIRecord" USING 
000850                                ACM-FILE-IDENT
000860                                ACM-RECORD
000870                                ACM-STATUS-ALL.
000880     IF  ACM-STATUS-CODE = "00"
000890         MOVE ACM-RECORD TO I-RECORD
000900     END-IF.
000910     IF ACM-STATUS-CODE = "10"
000920         MOVE 1 TO END-FLG
000930     END-IF.
000940     IF  END-FLG  =  ZERO
000950*        終端に達していなければカウンターを増分
000960         ADD  1              TO  I-COUNTER
000970     END-IF.
000980     EXIT.
000990*出力処理節
001000 OUT-WRITE                   SECTION.
001010     DISPLAY  I-RECORD.
001020     ADD  1                  TO  O-COUNTER.
001030     EXIT.
001040*ファイルを閉じる節
001050 FL-CLOSE                    SECTION.
001060*     CLOSE  INP-FILE.
001070     MOVE "dbtests" TO ACM-FILE-IDENT.
001080     CALL "closeJNIFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
001090     EXIT.
001100*終了処理
001110 TERM                        SECTION.
001120     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
001130     DISPLAY   "INPUT-COUNT:" I-COUNTER.
001140     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
001150     EXIT.
