000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. TESTSUB.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000290 WORKING-STORAGE SECTION.
000300 01  WK-STAT                PIC X(02).
000310 LINKAGE SECTION.
000350 01  HEAD-AREA.
000360  02  X-TYPE1               PIC X(20).
000350 01  IN-AREA.
000360  02  X-TYPE2               PIC X(20).
000350 01  OUT-AREA.
000360  02  X-TYPE3               PIC X(20).
000570 PROCEDURE DIVISION USING HEAD-AREA IN-AREA OUT-AREA.
000580 MAIN-PROC.
000590    MOVE  "HEAD-OUT"        TO  X-TYPE1.
000600    MOVE  X-TYPE2           TO  X-TYPE3.
000610    DISPLAY X-TYPE3.
000650 MAIN-EXIT.
000660    EXIT PROGRAM.
