000010*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000020*サンプルプログラム
000030*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID.                 DYNTEST1.
000060*AUTHOR.                     KENJI KIMURA.
000070 ENVIRONMENT DIVISION.
000080* INPUT-OUTPUT SECTION.
000090* FILE-CONTROL.
000100*    入力ファイル
000110**ACMFILE
000120* SELECT INP-FILE ASSIGN TO "dbtests2"
000130*        ORGANIZATION IS INDEXED
000140*        ACCESS MODE  IS DYNAMIC
000150*        RECORD KEY   IS I-ID.
000160 DATA DIVISION.
000170* FILE SECTION.
000180*入力ファイル
000190* FD  INP-FILE.
000200* COPY "I_RECORD2.cbl".
000210 WORKING-STORAGE SECTION.
000220*ACM Generated Contraints
000230 COPY "ACMCONSTS.CBL".
000240*ACM Genrated File Record
000250 COPY "I_RECORD2.cbl".
000260 01  SOME-AREA.
000270     05  I-COUNTER           PIC 9(05).
000280     05  O-COUNTER           PIC 9(05).
000290     05  END-FLG             PIC 9(01)  VALUE  ZERO.
000300     05  DSP-PROC            PIC 9(01)  VALUE  ZERO.
000310     05  WRK-FUDOU           PIC S9(07).
000320*
000330 COPY "SCR_RECORD.cbl".
000340*画面
000350*SCREEN SECTION.
000360*
000370*COPY "DSP_RECORD.cbl".
000380*
000390 PROCEDURE DIVISION.
000400*主処理節
000410     CALL "initializeSessionEnv" USING ACM-STATUS-ALL.
000420     PERFORM   INIT.
000430     PERFORM   FL-OPEN.
000440*    入力ファイルが終了するまで繰り返し
000450     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
000460        DISPLAY   "PROC?"
000470        ACCEPT    DSP-PROC   
000480        EVALUATE  DSP-PROC
000490        WHEN  0
000500*           終了
000510            MOVE  1  TO  END-FLG
000520        WHEN  1
000530*           追加
000540            DISPLAY  SCR-RECORD
000550            ACCEPT   SCR-RECORD
000560            PERFORM  OUT-WRITE
000570        WHEN  2
000580*           読み込み
000590            DISPLAY  SCR-RECORD
000600            ACCEPT    SCR-RECORD
000610            PERFORM  INP-READ             
000620            DISPLAY  SCR-RECORD
000630        WHEN  3
000640*           更新
000650            DISPLAY  SCR-RECORD
000660            ACCEPT   SCR-RECORD
000670            PERFORM  OUT-REWRITE
000680        WHEN  9
000690*           削除
000700            DISPLAY  SCR-RECORD
000710            ACCEPT   SCR-RECORD
000720            PERFORM  OUT-DELETE
000730        END-EVALUATE
000740     END-PERFORM.
000750     PERFORM   FL-CLOSE.
000760     PERFORM   TERM.
000770     CALL  "terminateSession" USING ACM-STATUS-ALL.
000780     STOP RUN.
000790*開始処理
000800 INIT SECTION.
000810     DISPLAY   "PROGRAM STARTING.".
000820     EXIT.
000830*ファイルを開く節
000840 FL-OPEN SECTION.
000850*     OPEN   I-O  INP-FILE.
000860     MOVE "dbtests2" TO ACM-FILE-IDENT.
000870     CALL "assignACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
000880     CALL "openACMFile"   USING ACM-FILE-IDENT
000890                                ACM-OPENMODE-IO
000900                                ACM-ACCESSMODE-DYN
000910                                ACM-STATUS-ALL.
000920     EXIT.
000930*入力処理節
000940 INP-READ SECTION.
000950     MOVE SCR-ID  TO  I-ID.
000960*     READ INP-FILE 
000970*     INVALID KEY
000980*         DISPLAY  "CANT FIND"
000990*         MOVE  1  TO  END-FLG
001000*     END-READ.
001010     MOVE "dbtests2" TO ACM-FILE-IDENT.
001020     MOVE I-RECORD TO ACM-RECORD.
001030     CALL "moveReadACMRecord" USING 
001040                                ACM-FILE-IDENT
001050                                ACM-RECORD
001060                                ACM-STATUS-ALL.
001070     IF  ACM-STATUS-CODE = "00"
001080         MOVE ACM-RECORD TO I-RECORD
001090     END-IF.
001100     IF ACM-STATUS-CODE = "23"
001110         DISPLAY  "CANT FIND"
001120         MOVE  1  TO  END-FLG
001130     END-IF.
001140     IF  END-FLG  =  ZERO
001150*        終端に達していなければカウンターを増分
001160         ADD  1              TO  I-COUNTER
001170         PERFORM REC2SCR
001180     END-IF.
001190     EXIT.
001200*出力処理節
001210 OUT-WRITE SECTION.
001220     PERFORM SCR2REC.
001230* ACM Generated Write
001240*     WRITE I-RECORD
001250*     INVALID KEY
001260*         MOVE  1  TO  END-FLG
001270*     NOT INVALID KEY
001280*         INITIALIZE   SCR-RECORD
001290*     END-WRITE.
001300     MOVE "dbtests2" TO ACM-FILE-IDENT.
001310     MOVE I-RECORD TO ACM-RECORD
001320     CALL "writeACMRecord" USING ACM-FILE-IDENT
001330                                 ACM-RECORD
001340                                 ACM-STATUS-ALL.
001350     IF ACM-STATUS-CODE = "22"
001360         MOVE  1  TO  END-FLG
001370     ELSE
001380         INITIALIZE   SCR-RECORD
001390     END-IF.
001400     ADD  1                  TO  O-COUNTER.
001410     EXIT.
001420*出力処理節
001430 OUT-REWRITE SECTION.
001440     PERFORM SCR2REC.
001450* ACM Generated Write
001460*     REWRITE I-RECORD
001470*     INVALID  KEY
001480*         MOVE  1  TO  END-FLG
001490*     NOT INVALID KEY
001500*         INITIALIZE   SCR-RECORD
001510*     END-REWRITE.
001520     MOVE "dbtests2" TO ACM-FILE-IDENT.
001530     MOVE I-RECORD TO ACM-RECORD
001540     CALL "rewriteACMRecord" USING ACM-FILE-IDENT
001550                                   ACM-RECORD
001560                                   ACM-STATUS-ALL.
001570     IF ACM-STATUS-CODE = "23"
001580         MOVE  1  TO  END-FLG
001590     ELSE
001600         INITIALIZE   SCR-RECORD
001610     END-IF.
001620     ADD  1                  TO  O-COUNTER.
001630     EXIT.
001640*出力処理節
001650 OUT-DELETE SECTION.
001660     PERFORM SCR2REC.
001670*     DELETE INP-FILE
001680* ACM Generated Write
001690*     DELETE INP-FILE
001700*     INVALID  KEY
001710*         MOVE  1  TO  END-FLG
001720*     NOT INVALID KEY
001730*         INITIALIZE   SCR-RECORD
001740*     END-DELETE.
001750     MOVE "dbtests2" TO ACM-FILE-IDENT.
001760     MOVE I-RECORD TO ACM-RECORD
001770     CALL "deleteACMRecord" USING ACM-FILE-IDENT
001780                                  ACM-RECORD
001790                                  ACM-STATUS-ALL.
001800     IF ACM-STATUS-CODE = "23"
001810         MOVE  1  TO  END-FLG
001820     ELSE
001830         INITIALIZE   SCR-RECORD
001840     END-IF.
001850     ADD  1                  TO  O-COUNTER.
001860     EXIT.
001870*レコード転送節
001880 REC2SCR SECTION.
001890     INITIALIZE              SCR-RECORD.
001900     MOVE I-ID            TO SCR-ID.
001910     MOVE I-CD            TO SCR-CD.
001920     MOVE I-NIHONGO       TO SCR-NIHONGO.
001930*    MOVE I-SEISU         TO SCR-SEISU.
001940     IF  I-SEISU  >  ZERO
001950         MOVE I-SEISU     TO SCR-SEISU
001960         MOVE ZERO        TO SCR-SEISU-FLG
001970     ELSE
001980         COMPUTE SCR-SEISU = I-SEISU * (-1)
001990         MOVE    1        TO SCR-SEISU-FLG
002000     END-IF
002010     MOVE I-HIZUKE-YYYY   TO SCR-HIZUKE-YYYY.
002020     MOVE I-HIZUKE-MM     TO SCR-HIZUKE-MM.
002030     MOVE I-HIZUKE-DD     TO SCR-HIZUKE-DD.
002040     MOVE I-JIKOKU-HH     TO SCR-JIKOKU-HH.
002050     MOVE I-JIKOKU-MM     TO SCR-JIKOKU-MM.
002060     MOVE I-JIKOKU-SS     TO SCR-JIKOKU-SS.
002070*    MOVE I-FUDOU         TO SCR-FUDOU.
002080     IF  I-FUDOU  >  ZERO
002090         COMPUTE WRK-FUDOU = I-FUDOU *   1000
002100         MOVE ZERO        TO SCR-FUDOU-FLG
002110     ELSE
002120         COMPUTE WRK-FUDOU = I-FUDOU * (-1000)
002130         MOVE    1        TO SCR-FUDOU-FLG
002140     END-IF.
002150     MOVE  WRK-FUDOU(1:4) TO SCR-FUDOU1.
002160     MOVE  WRK-FUDOU(5:3) TO SCR-FUDOU2.
002170     EXIT.
002180*レコード転送節
002190 SCR2REC SECTION.
002200     MOVE SCR-ID          TO I-ID.
002210     MOVE SCR-CD          TO I-CD.
002220     MOVE SCR-NIHONGO     TO I-NIHONGO.
002230*    MOVE SCR-SEISU       TO I-SEISU.
002240     IF  SCR-SEISU-FLG  = ZERO
002250         MOVE SCR-SEISU       TO I-SEISU
002260     ELSE
002270         COMPUTE  I-SEISU  = SCR-SEISU * (-1)
002280     END-IF
002290     MOVE SCR-HIZUKE-YYYY TO I-HIZUKE-YYYY.
002300     MOVE SCR-HIZUKE-MM   TO I-HIZUKE-MM.
002310     MOVE SCR-HIZUKE-DD   TO I-HIZUKE-DD.
002320     MOVE SCR-JIKOKU-HH   TO I-JIKOKU-HH.
002330     MOVE SCR-JIKOKU-MM   TO I-JIKOKU-MM.
002340     MOVE SCR-JIKOKU-SS   TO I-JIKOKU-SS.
002350*    MOVE SCR-FUDOU       TO I-FUDOU.
002360     COMPUTE  WRK-FUDOU   =  SCR-FUDOU1  *  1000
002370                          +  SCR-FUDOU2.
002380     IF   SCR-FUDOU-FLG   NOT  =  ZERO
002390          COMPUTE  I-FUDOU = WRK-FUDOU   /  (-1000)
002400     ELSE
002410          COMPUTE  I-FUDOU = WRK-FUDOU   /    1000
002420     END-IF.
002430     EXIT.
002440*ファイルを閉じる節
002450 FL-CLOSE SECTION.
002460*     CLOSE  INP-FILE.
002470     MOVE "dbtests2" TO ACM-FILE-IDENT.
002480     CALL "closeACMFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
002490     EXIT.
002500*終了処理
002510 TERM SECTION.
002520     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
002530     DISPLAY   "INPUT-COUNT:" I-COUNTER.
002540     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
002550     EXIT.
002560
