000010*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000020*サンプルプログラム
000030*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000040 IDENTIFICATION              DIVISION.
000050 PROGRAM-ID.                 WRTTEST.
000060*AUTHOR.                     KENJI KIMURA.
000070 ENVIRONMENT                 DIVISION.
000080 CONFIGURATION               SECTION.
000090* INPUT-OUTPUT                SECTION.
000100* FILE-CONTROL.
000110*    入力ファイル
000120**ACMFILE
000130*     SELECT OUT-FILE ASSIGN TO "dbtests2"
000140*       ORGANIZATION LINE SEQUENTIAL.
000150 DATA                        DIVISION.
000160* FILE                        SECTION.
000170*入力ファイル
000180* FD  OUT-FILE.
000190*     COPY "O_RECORD2.cbl".
000200 WORKING-STORAGE             SECTION.
000210*ACM Generated Contraints
000220 COPY "ACMCONSTS.CBL".
000230*ACM Genrated File Record
000240     COPY "O_RECORD2.cbl".
000250 01  SOME-AREA.
000260     05  I-COUNTER           PIC 9(05).
000270     05  O-COUNTER           PIC 9(05).
000280     05  END-FLG             PIC 9(01)  VALUE  ZERO.
000290     05  W-COUNTER           PIC S9(05).
000300 01  WORK-AREA.
000310     05  W-A                 PIC S9(09).
000320     05  W-B                 PIC S9(09).
000330     05  W-C                 PIC S9(09).
000340     05  W-D                 PIC S9(09).
000350     05  W-EF.
000360       07  W-E               PIC 9(04).
000370       07  FILLER            PIC X(01)  VALUE  ".".
000380       07  W-F               PIC 9(03).
000390 PROCEDURE                   DIVISION.
000400*主処理節
000410     CALL "initializeJNISessionEnv" USING ACM-STATUS-ALL.
000420     PERFORM   INIT.
000430     PERFORM   FL-OPEN.
000440     PERFORM   OUT-EDIT.
000450*    入力ファイルが終了するまで繰り返し
000460     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
000470        PERFORM  OUT-WRITE
000480        PERFORM  OUT-EDIT
000490     END-PERFORM.
000500     PERFORM   FL-CLOSE.
000510     PERFORM   TERM.
000520     CALL  "terminateJNISession" USING ACM-STATUS-ALL.
000530     STOP RUN.
000540*開始処理
000550 INIT                        SECTION.
000560     DISPLAY   "PROGRAM STARTING.".
000570     MOVE  -5000  TO  W-COUNTER.
000580     MOVE  0      TO  I-COUNTER.
000590    MOVE "TRANSACTION_READ_COMMITTED" TO ACM-OPTION.
000600    CALL "setJNITransMode" USING ACM-OPTION
000610                                   ACM-STATUS-ALL.
000620    MOVE "false" TO ACM-OPTION.
000630    CALL "setJNICommitMode" USING ACM-OPTION
000640                                    ACM-STATUS-ALL.
000650     EXIT.
000660*ファイルを開く節
000670 FL-OPEN                     SECTION.
000680*     OPEN   OUTPUT  OUT-FILE.
000690     MOVE "dbtests2" TO ACM-FILE-IDENT.
000700     CALL "assignJNIFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
000710     CALL "openJNIFile"   USING ACM-FILE-IDENT
000720                                ACM-OPENMODE-OUTPUT
000730                                ACM-ACCESSMODE-SEQ
000740                                ACM-STATUS-ALL.
000750     EXIT.
000760*入力処理節
000770 OUT-EDIT                    SECTION.
000780     ADD  1              TO  I-COUNTER.
000790     ADD  1              TO  W-COUNTER.
000800*    編集の本体
000810     MOVE I-COUNTER      TO  O-ID.
000820     MOVE I-COUNTER      TO  O-CD.
000830     MOVE I-COUNTER      TO  O-NIHONGO.
000840     MOVE W-COUNTER      TO  O-SEISU.
000850     COMPUTE  W-A  =  I-COUNTER  +  12000.
000860     DIVIDE  W-A  BY  2001  GIVING  W-C
000870                         REMAINDER  O-HIZUKE-YYYY.
000880     ADD     1000        TO  O-HIZUKE-YYYY.
000890     DIVIDE  W-A  BY  12    GIVING  W-C
000900                         REMAINDER  O-HIZUKE-MM.
000910     ADD     1           TO  O-HIZUKE-MM.
000920     DIVIDE  W-A  BY  28    GIVING  W-C
000930                         REMAINDER  O-HIZUKE-DD.
000940     ADD     1           TO  O-HIZUKE-DD.
000950     DIVIDE  W-A  BY  23    GIVING  W-C
000960                         REMAINDER  O-JIKOKU-HH.
000970     ADD     1           TO  O-JIKOKU-HH.
000980     DIVIDE  W-A  BY  59    GIVING  W-C
000990                         REMAINDER  O-JIKOKU-MM.
001000     ADD     1           TO  O-JIKOKU-MM.
001010     DIVIDE  W-A  BY  59    GIVING  W-C
001020                         REMAINDER  O-JIKOKU-SS.
001030     ADD     1           TO  O-JIKOKU-SS.
001040     COMPUTE  O-FUDOU  =  W-COUNTER  /  1000.
001050     IF  I-COUNTER  >  10000
001060*        終端に達していなければカウンターを増分
001070         MOVE  1         TO  END-FLG
001080     END-IF.
001090     EXIT.
001100*出力処理節
001110 OUT-WRITE                   SECTION.
001120* ACM Generated Write
001130*     WRITE  O-RECORD.
001140     MOVE "dbtests2" TO ACM-FILE-IDENT.
001150     MOVE O-RECORD TO ACM-RECORD
001160     CALL "writeJNIRecord" USING ACM-FILE-IDENT
001170                                 ACM-RECORD
001180                                 ACM-STATUS-ALL.
001190     ADD  1                  TO  O-COUNTER.
001200     IF  O-COUNTER = 1000
001210    CALL "commitJNISession" USING ACM-STATUS-ALL
001220         DISPLAY  "COMMIT." O-COUNTER
001230     END-IF.
001240     IF  O-COUNTER = 2000
001250    CALL "rollbackJNISession" USING ACM-STATUS-ALL
001260         DISPLAY  "ROLLBACK." O-COUNTER
001270     END-IF.
001280     IF  O-COUNTER = 3000
001290    CALL "commitJNISession" USING ACM-STATUS-ALL
001300         DISPLAY  "COMMIT." O-COUNTER
001310     END-IF.
001320     IF  O-COUNTER = 4000
001330    CALL "rollbackJNISession" USING ACM-STATUS-ALL
001340         DISPLAY  "ROLLBACK." O-COUNTER
001350     END-IF.
001360     IF  O-COUNTER = 5000
001370    CALL "commitJNISession" USING ACM-STATUS-ALL
001380         DISPLAY  "COMMIT." O-COUNTER
001390     END-IF.
001400     IF  O-COUNTER = 6000
001410    CALL "rollbackJNISession" USING ACM-STATUS-ALL
001420         DISPLAY  "ROLLBACK." O-COUNTER
001430     END-IF.
001440     IF  O-COUNTER = 7000
001450    CALL "commitJNISession" USING ACM-STATUS-ALL
001460         DISPLAY  "COMMIT." O-COUNTER
001470     END-IF.
001480     IF  O-COUNTER = 8000
001490    CALL "rollbackJNISession" USING ACM-STATUS-ALL
001500         DISPLAY  "ROLLBACK." O-COUNTER
001510     END-IF.
001520     IF  O-COUNTER = 9000
001530    CALL "commitJNISession" USING ACM-STATUS-ALL
001540         DISPLAY  "COMMIT." O-COUNTER
001550     END-IF.
001560     EXIT.
001570*ファイルを閉じる節
001580 FL-CLOSE                    SECTION.
001590    CALL "commitJNISession" USING ACM-STATUS-ALL.
001600*     CLOSE  OUT-FILE.
001610     MOVE "dbtests2" TO ACM-FILE-IDENT.
001620     CALL "closeJNIFile" USING ACM-FILE-IDENT ACM-STATUS-ALL.
001630     EXIT.
001640*終了処理
001650 TERM                        SECTION.
001660     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
001670     DISPLAY   "OUTUT-COUNT:" I-COUNTER.
001680     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
001690     EXIT.
