000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCC
000200*                    
000300 01 O-RECORD.
000350   10 O-ID                  PIC  9(05).
000400   10 O-CD                  PIC  X(20).
000500   10 O-NIHONGO             PIC  X(20).
000600   10 O-SEISU               PIC  9(07).
000700   10 O-HIZUKE.
000800     20 O-HIZUKE-YYYY       PIC  9(04).
000900     20 O-HIZUKE-MM         PIC  9(02).
001000     20 O-HIZUKE-DD         PIC  9(02).
001100   10 O-JIKOKU.
001200     20 O-JIKOKU-HH         PIC  9(02).
001300     20 O-JIKOKU-MM         PIC  9(02).
001400     20 O-JIKOKU-SS         PIC  9(02).
001500   10 O-FUDOU               PIC  9999.999.
