000100* ACMパラメータ 
000200 01 ACM-PARAMS.
000300   03 ACM-STATUS-ALL.
000400*001
000500      05 ACM-STATUS-CODE   PIC X(02).
000600*003
000700      05 FILLER             PIC X(01) VALUE " ".
000800*004
000900      05 ACM-STATUS-SQL    PIC X(05).
001000*009
001100      05 FILLER             PIC X(01) VALUE " ".
001200*010
001300      05 ACM-STATUS-ERR    PIC 9(11).
001400*021
001500      05 FILLER             PIC X(01) VALUE " ".
001600*022
001700      05 ACM-STATUS-MSG    PIC X(233).
001800*255   
001900      05 FILLER             PIC X(01) VALUE " ".
002000   03 ACM-FILE-IDENT       PIC X(256).
002100   03 ACM-OPTION           PIC X(256).
002200   03 ACM-START-OPTION     REDEFINES  ACM-OPTION.
002300      04  ACM-START-MODE   PIC X(30).
002400      04  ACM-INDEX-NAME   PIC X(226).
002200   03 ACM-OPTION-SET       REDEFINES  ACM-OPTION.
002300      04  ACM-OPTION-NAME  PIC X(30).
002400      04  ACM-OPTION-VALUE PIC X(226).
002500* レコード
002600 01 ACM-RECORD             PIC X(8192).
002700* ACMリテラル
002800 01  ACM-CONST.
002900   03 ACM-OPENMODE.
003000      05 ACM-OPENMODE-INPUT   PIC X(07) VALUE "INPUT  ".
003100      05 FILLER               PIC X(01) VALUE " ".
003200      05 ACM-OPENMODE-IO      PIC X(07) VALUE "IO     ".
003300      05 FILLER               PIC X(01) VALUE " ".
003400      05 ACM-OPENMODE-OUTPUT  PIC X(07) VALUE "OUTPUT ".
003500      05 FILLER               PIC X(01) VALUE " ".
003600      05 ACM-OPENMODE-EXTEND  PIC X(07) VALUE "EXTEND ".
003700      05 FILLER               PIC X(01) VALUE " ".
003800   03 ACM-ACCESSMODE.
003900      05 ACM-ACCESSMODE-SEQ   PIC X(07) VALUE "SEQUENC".
004000      05 FILLER               PIC X(01) VALUE " ".
004100      05 ACM-ACCESSMODE-RND   PIC X(07) VALUE "RANDOM ".
004200      05 FILLER               PIC X(01) VALUE " ".
004300      05 ACM-ACCESSMODE-DYN   PIC X(07) VALUE "DYNAMIC".
004400      05 FILLER               PIC X(01) VALUE " ".
004500   03 ACM-STARTMODE.
004600      05 IS-EQUAL-TO          PIC X(30)
004700                 VALUE "IS_EQUAL_TO                   ".
004800      05 IS-GREATER-THAN      PIC X(30)
004900                 VALUE "IS_GREATER_THAN               ".
005000      05 IS-GREATER-THAN-OR-EQUAL-TO
005100                              PIC X(30)
005200                 VALUE "IS_GREATER_THAN_OR_EQUAL_TO   ".
005300      05 IS-NOT-LESS-THAN     PIC X(30)
005400                 VALUE "IS_NOT_LESS_THAN              ".
