000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCC
000200*                    
000300 01 DATA-TYPES.
000350   10 TYPE-A                  PIC  A(04).
000350   10 TYPE-X                  PIC  X(10).
000350   10 TYPE-9                  PIC  9(18).
000350*  10 TYPE-N                  PIC  N(03).
000350   10 TYPE-SP                 PIC  S9(05).
000350   10 TYPE-SM                 PIC  S9(05).
000350   10 TYPE-V                  PIC  9V99.
000350   10 TYPE-P                  PIC  99PP.
000350   10 TYPE-0                  PIC  X(2)00.
000350   10 TYPE-XB                 PIC  XBX.
000350*  10 TYPE-NB                 PIC  NBN.
000350   10 TYPE-CONMA              PIC  9,999.
000350   10 TYPE-SLASH              PIC  99/99.
000350   10 TYPE-PERIOD             PIC  9.99.
000350   10 TYPE-PLUS               PIC  +999.
000350   10 TYPE-MINUS              PIC  -999.
000350   10 TYPE-CR1                PIC  9CR.
000350   10 TYPE-DB1                PIC  9DB.
000350   10 TYPE-CR2                PIC  9CR.
000350   10 TYPE-DB2                PIC  9DB.
000350   10 TYPE-Z                  PIC  ZZZ9.
000350   10 TYPE-AST                PIC  ***9.
000350*  10 TYPE-BS                 PIC  \\\9.
000350   10 TYPE-FOM1               PIC  9,999.
000350   10 TYPE-FOM2               PIC  9,000.
000350   10 TYPE-FOM3               PIC  +999.
000350   10 TYPE-FOM4               PIC  -999.
000350*  10 TYPE-FOM5               PIC  \,\\9.
000350*  10 TYPE-FOM6               PIC  \,\\9.
000350*  10 TYPE-FOM7               PIC  \\,\\9.
000350   10 TYPE-FOM8               PIC  ZZ9.
000350   10 TYPE-FOM9               PIC  Z,ZZ9.
000350   10 TYPE-DISP               PIC  S9(03).
000350   10 TYPE-PACKED-DECIMAL     PIC  S9(03) USAGE PACKED-DECIMAL.
000350   10 TYPE-COMP-3             PIC  S9(04) USAGE COMP-3.
000350   10 TYPE-BIN1               PIC  S9(01) USAGE COMP.
000350   10 TYPE-BIN4               PIC  S9(04) USAGE COMP.
000350   10 TYPE-BIN5               PIC  S9(05) USAGE COMP.
000350   10 TYPE-BIN9               PIC  S9(09) USAGE COMP.
000350   10 TYPE-BIN10              PIC  S9(10) USAGE COMP.
000350   10 TYPE-BIN18              PIC  S9(18) USAGE COMP.
