000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000200*                      
000300*                    (SEQ)                        (SEQ)                  
000400 IDENTIFICATION DIVISION.
000500 PROGRAM-ID.                 DYNTEST1.
000600*AUTHOR.                     KENJI KIMURA.
000700 ENVIRONMENT DIVISION.
000800 INPUT-OUTPUT SECTION.
000900 FILE-CONTROL.
001000*                        
001100*ACMFILE
001200*ACMRECNAME=I-RECORD
001300 SELECT INP-FILE ASSIGN TO "dbtests2"
001400        ORGANIZATION IS INDEXED
001500        ACCESS MODE  IS DYNAMIC
001600        RECORD KEY   IS I-ID.
001700 DATA DIVISION.
001800 FILE SECTION.
001900*                    
002000 FD  INP-FILE.
002100 COPY "I_RECORD2.cbl".
002200 WORKING-STORAGE SECTION.
002300 01  SOME-AREA.
002400     05  I-COUNTER           PIC 9(05).
002500     05  O-COUNTER           PIC 9(05).
002600     05  END-FLG             PIC 9(01)  VALUE  ZERO.
002700     05  DSP-PROC            PIC 9(01)  VALUE  ZERO.
           05  WRK-FUDOU           PIC S9(07).
002800*
002900 COPY "SCR_RECORD.cbl".
003000*        
003100*SCREEN SECTION.
003200*
003300*COPY "DSP_RECORD.cbl".
003400*
003500 PROCEDURE DIVISION.
003600*              
003700 MAIN SECTION.
003800     PERFORM   INIT.
003900     PERFORM   FL-OPEN.
004000*                                                      
004100     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
004200        DISPLAY   "PROC?"
004300        ACCEPT    DSP-PROC   
004400        EVALUATE  DSP-PROC
004500        WHEN  0
004600*                 
004700            MOVE  1  TO  END-FLG
004800        WHEN  1
004900*                 
005000            DISPLAY  SCR-RECORD
005100            ACCEPT   SCR-RECORD
005200            PERFORM  OUT-WRITE
005300        WHEN  2
005400*                       
005500            DISPLAY  SCR-RECORD
005600            ACCEPT    SCR-RECORD
005700            PERFORM  INP-READ             
005800            DISPLAY  SCR-RECORD
005900        WHEN  3
006000*                   
006100            DISPLAY  SCR-RECORD
006200            ACCEPT   SCR-RECORD
006300            PERFORM  OUT-REWRITE
006400        WHEN  9
006500*                 
006600            DISPLAY  SCR-RECORD
006700            ACCEPT   SCR-RECORD
006800            PERFORM  OUT-DELETE
006900        END-EVALUATE
007000     END-PERFORM.
007100     PERFORM   FL-CLOSE.
007200     PERFORM   TERM.
007300     STOP RUN.
007400*              
007500 INIT SECTION.
007600     DISPLAY   "PROGRAM STARTING.".
007700     EXIT.
007800*                      
007900 FL-OPEN SECTION.
008000     OPEN   I-O  INP-FILE.
008100     EXIT.
008200*                  
008300 INP-READ SECTION.
008400     MOVE SCR-ID  TO  I-ID.
008500     READ INP-FILE 
008600     INVALID KEY
008700         DISPLAY  "CANT FIND"
008800         MOVE  1  TO  END-FLG
008900     END-READ.
009000     IF  END-FLG  =  ZERO
009100*                                                                
009200         ADD  1              TO  I-COUNTER
009300         PERFORM REC2SCR
009400     END-IF.
009500     EXIT.
009600*                  
009700 OUT-WRITE SECTION.
009800     PERFORM SCR2REC.
009900     WRITE I-RECORD
010000     INVALID KEY
010100         MOVE  1  TO  END-FLG
010200     NOT INVALID KEY
010300         INITIALIZE   SCR-RECORD
010400     END-WRITE.
010500     ADD  1                  TO  O-COUNTER.
010600     EXIT.
010700*                  
010800 OUT-REWRITE SECTION.
010900     PERFORM SCR2REC.
011000     REWRITE I-RECORD
011100     INVALID  KEY
011200         MOVE  1  TO  END-FLG
011300     NOT INVALID KEY
011400         INITIALIZE   SCR-RECORD
011500     END-REWRITE.
011600     ADD  1                  TO  O-COUNTER.
011700     EXIT.
011800*                  
011900 OUT-DELETE SECTION.
012000     PERFORM SCR2REC.
012100     DELETE INP-FILE
012200     INVALID  KEY
012300         MOVE  1  TO  END-FLG
012400     NOT INVALID KEY
012500         INITIALIZE   SCR-RECORD
012600     END-DELETE.
012700     ADD  1                  TO  O-COUNTER.
012800     EXIT.
012900*                      
013000 REC2SCR SECTION.
013100     INITIALIZE              SCR-RECORD.
013200     MOVE I-ID            TO SCR-ID.
013300     MOVE I-CD            TO SCR-CD.
013400     MOVE I-NIHONGO       TO SCR-NIHONGO.
013500*    MOVE I-SEISU         TO SCR-SEISU.
013600     IF  I-SEISU  >  ZERO
013700         MOVE I-SEISU     TO SCR-SEISU
013800         MOVE ZERO        TO SCR-SEISU-FLG
013900     ELSE
014000         COMPUTE SCR-SEISU = I-SEISU * (-1)
014100         MOVE    1        TO SCR-SEISU-FLG
014200     END-IF
014300     MOVE I-HIZUKE-YYYY   TO SCR-HIZUKE-YYYY.
014400     MOVE I-HIZUKE-MM     TO SCR-HIZUKE-MM.
014500     MOVE I-HIZUKE-DD     TO SCR-HIZUKE-DD.
014600     MOVE I-JIKOKU-HH     TO SCR-JIKOKU-HH.
014700     MOVE I-JIKOKU-MM     TO SCR-JIKOKU-MM.
014800     MOVE I-JIKOKU-SS     TO SCR-JIKOKU-SS.
014900*    MOVE I-FUDOU         TO SCR-FUDOU.
           IF  I-FUDOU  >  ZERO
013700         COMPUTE WRK-FUDOU = I-FUDOU *   1000
013800         MOVE ZERO        TO SCR-FUDOU-FLG
           ELSE
014000         COMPUTE WRK-FUDOU = I-FUDOU * (-1000)
014100         MOVE    1        TO SCR-FUDOU-FLG
           END-IF.
           MOVE  WRK-FUDOU(1:4) TO SCR-FUDOU1.
           MOVE  WRK-FUDOU(5:3) TO SCR-FUDOU2.
015000     EXIT.
015100*                      
015200 SCR2REC SECTION.
015300     MOVE SCR-ID          TO I-ID.
015400     MOVE SCR-CD          TO I-CD.
015500     MOVE SCR-NIHONGO     TO I-NIHONGO.
015600*    MOVE SCR-SEISU       TO I-SEISU.
015700     IF  SCR-SEISU-FLG  = ZERO
015800         MOVE SCR-SEISU       TO I-SEISU
015900     ELSE
016000         COMPUTE  I-SEISU  = SCR-SEISU * (-1)
016100     END-IF
016200     MOVE SCR-HIZUKE-YYYY TO I-HIZUKE-YYYY.
016300     MOVE SCR-HIZUKE-MM   TO I-HIZUKE-MM.
016400     MOVE SCR-HIZUKE-DD   TO I-HIZUKE-DD.
016500     MOVE SCR-JIKOKU-HH   TO I-JIKOKU-HH.
016600     MOVE SCR-JIKOKU-MM   TO I-JIKOKU-MM.
016700     MOVE SCR-JIKOKU-SS   TO I-JIKOKU-SS.
016800*    MOVE SCR-FUDOU       TO I-FUDOU.
           COMPUTE  WRK-FUDOU   =  SCR-FUDOU1  *  1000
                                +  SCR-FUDOU2.
           IF   SCR-FUDOU-FLG   NOT  =  ZERO
                COMPUTE  I-FUDOU = WRK-FUDOU   /  (-1000)
           ELSE
                COMPUTE  I-FUDOU = WRK-FUDOU   /    1000
           END-IF.
016900     EXIT.
017000*                              
017100 FL-CLOSE SECTION.
017200     CLOSE  INP-FILE.
017300     EXIT.
017400*              
017500 TERM SECTION.
017600     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
017700     DISPLAY   "INPUT-COUNT:" I-COUNTER.
017800     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
017900     EXIT.
018000
