000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000200*                      
000300*                    (SEQ)                        (SEQ)                  
000400 IDENTIFICATION DIVISION.
000500 PROGRAM-ID.                 DYNTEST.
000600*AUTHOR.                     KENJI KIMURA.
000700 ENVIRONMENT DIVISION.
000800 INPUT-OUTPUT SECTION.
000900 FILE-CONTROL.
001000*                        
001100*ACMFILE
001200*ACMRECNAME=I-RECORD
001300 SELECT INP-FILE ASSIGN TO "dbtests2"
001400        ORGANIZATION IS INDEXED
001500        ACCESS MODE  IS DYNAMIC
001600        RECORD KEY   IS I-ID.
001700 DATA DIVISION.
001800 FILE SECTION.
001900*                    
002000 FD  INP-FILE.
002100 COPY "I_RECORD2.cbl".
002200 WORKING-STORAGE SECTION.
002300 01  SOME-AREA.
002400     05  I-COUNTER           PIC 9(05).
002500     05  O-COUNTER           PIC 9(05).
002600     05  END-FLG             PIC 9(01)  VALUE  ZERO.
       01  FUDOU-AREA.
           05  W-FUDOU             PIC S9(4)V9(3).
           05  INTDATA             PIC 9(07).
           05  INT1000             PIC 9(07).
           05  INTDEC              PIC 9(07).
002700*
002800 COPY "SCR_RECORD.cbl".
002900*ACMCOMMENTSTART
003000 SCREEN SECTION.
003100*
003200 COPY "DSP_RECORD.cbl".
003300*ACMCOMMENTEND
003400 PROCEDURE DIVISION.
003500*              
003600 MAIN SECTION.
003700     PERFORM   INIT.
003800     PERFORM   FL-OPEN.
003900*                                                      
004000     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
004100*ACMCOMMENTSTART
004200        DISPLAY   DSP-RECORD2
004300        ACCEPT    DSP-RECORD1
004400*ACMCOMMENTEND
004500*ACMINSERTSTART
004600*       ACCEPT    SCR-RECORD
004700*ACMINSERTEND
004800        EVALUATE  SCR-PROC
004900        WHEN  0
005000*                 
005100            MOVE  1  TO  END-FLG
005200        WHEN  1
005300*                 
005400            PERFORM  OUT-WRITE
005500        WHEN  2
005600*                       
005700            PERFORM  INP-READ
005800        WHEN  3
005900*                   
006000            PERFORM  OUT-REWRITE
006100        WHEN  9
006200*                 
006300            PERFORM  OUT-DELETE
006400        END-EVALUATE
006500*ACMINSERTSTART
006600*       DISPLAY   SCR-RECORD
006700*ACMINSERTEND
006800     END-PERFORM.
006900     PERFORM   FL-CLOSE.
007000     PERFORM   TERM.
007100     STOP RUN.
007200*              
007300 INIT SECTION.
007400*ACMCOMMENTSTART
007500     DISPLAY   "PROGRAM STARTING.".
007600*ACMCOMMENTEND
007700     EXIT.
007800*                      
007900 FL-OPEN SECTION.
008000     OPEN   I-O  INP-FILE.
008100     EXIT.
008200*                  
008300 INP-READ SECTION.
008400     MOVE SCR-ID  TO  I-ID.
008500     READ INP-FILE 
008600     INVALID KEY
008700*ACMCOMMENTSTART
008800         DISPLAY  "CANT FIND"
008900         MOVE  1  TO  END-FLG
009000*ACMCOMMENTEND
009100*ACMINSERTSTART
009200*        MOVE ALL "0" TO SCR-RECORD
009300*ACMINSERTEND
009500     END-READ.
009600     IF  END-FLG  =  ZERO
009700*                                                                
009800         ADD  1              TO  I-COUNTER
009900         PERFORM REC2SCR
010000     END-IF.
010100     EXIT.
010200*                  
010300 OUT-WRITE SECTION.
010400     PERFORM SCR2REC.
010500     WRITE I-RECORD
010600     INVALID KEY
010700         MOVE  1  TO  END-FLG
010800     NOT INVALID KEY
010900         INITIALIZE   SCR-RECORD
011000     END-WRITE.
011100     ADD  1                  TO  O-COUNTER.
011200     EXIT.
011300*                  
011400 OUT-REWRITE SECTION.
011500     PERFORM SCR2REC.
011600     REWRITE I-RECORD
011700     INVALID  KEY
011800         MOVE  1  TO  END-FLG
011900     NOT INVALID KEY
012000         INITIALIZE   SCR-RECORD
012100     END-REWRITE.
012200     ADD  1                  TO  O-COUNTER.
012300     EXIT.
012400*                  
012500 OUT-DELETE SECTION.
012600     PERFORM SCR2REC.
012700     DELETE INP-FILE
012800     INVALID  KEY
012900         MOVE  1  TO  END-FLG
013000     NOT INVALID KEY
013100         INITIALIZE   SCR-RECORD
013200     END-DELETE.
013300     ADD  1                  TO  O-COUNTER.
013400     EXIT.
013500*                      
013600 REC2SCR SECTION.
013700     MOVE I-ID            TO SCR-ID.
013800     MOVE I-CD            TO SCR-CD.
013900     MOVE I-NIHONGO       TO SCR-NIHONGO.
014000*    MOVE I-SEISU         TO SCR-SEISU.
014100     IF  I-SEISU  >  ZERO
014200         MOVE I-SEISU     TO SCR-SEISU
014300         MOVE ZERO        TO SCR-SEISU-FLG
014400     ELSE
014500         COMPUTE SCR-SEISU = I-SEISU * (-1)
014600         MOVE    1        TO SCR-SEISU-FLG
014700     END-IF
014800     MOVE I-HIZUKE-YYYY   TO SCR-HIZUKE-YYYY.
014900     MOVE I-HIZUKE-MM     TO SCR-HIZUKE-MM.
015000     MOVE I-HIZUKE-DD     TO SCR-HIZUKE-DD.
015100     MOVE I-JIKOKU-HH     TO SCR-JIKOKU-HH.
015200     MOVE I-JIKOKU-MM     TO SCR-JIKOKU-MM.
015300     MOVE I-JIKOKU-SS     TO SCR-JIKOKU-SS.
015400*    MOVE I-FUDOU         TO SCR-FUDOU.
           IF  I-FUDOU  >  ZERO
               MOVE  I-FUDOU    TO W-FUDOU
               MOVE  ZERO       TO  SCR-FUOUD-FLG
           ELSE
               COMPUTE  W-FUDOU  =  I-FUDOU * (-1)
               MOVE  1          TO  SCR-FUOUD-FLG
           END-IF.
           COMPUTE  INT1000      =  W-FUDOU  *  1000.
           MOVE  W-FUDOU        TO  INTDATA.
           COMPUTE  INTDEC       =  INT1000  -  INTDATA.
015500     EXIT.
015600*                      
015700 SCR2REC SECTION.
015800     MOVE SCR-ID          TO I-ID.
015900     MOVE SCR-CD          TO I-CD.
016000     MOVE SCR-NIHONGO     TO I-NIHONGO.
016100*    MOVE SCR-SEISU       TO I-SEISU.
016200     IF  SCR-SEISU-FLG  = ZERO
016300         MOVE SCR-SEISU       TO I-SEISU
016400     ELSE
016500         COMPUTE  I-SEISU  = SCR-SEISU * (-1)
016600     END-IF
016700     MOVE SCR-HIZUKE-YYYY TO I-HIZUKE-YYYY.
016800     MOVE SCR-HIZUKE-MM   TO I-HIZUKE-MM.
016900     MOVE SCR-HIZUKE-DD   TO I-HIZUKE-DD.
017000     MOVE SCR-JIKOKU-HH   TO I-JIKOKU-HH.
017100     MOVE SCR-JIKOKU-MM   TO I-JIKOKU-MM.
017200     MOVE SCR-JIKOKU-SS   TO I-JIKOKU-SS.
017300*    MOVE SCR-FUDOU       TO I-FUDOU.
           COMPUTE  W-FUDOU     =  SCR-FUDOU1  *  1000
                                +  SCR-FUDOU2.
           IF  SCR-FUDOU-FLG  = ZERO
               MOVE  W-FUDOU    TO  I-FUDOU
           ELSE
               COMPUTE  I-FUDOU  =  W-FUDOU * (-1)
           END-IF.
017400     EXIT.
017500*                              
017600 FL-CLOSE SECTION.
017700     CLOSE  INP-FILE.
017800     EXIT.
017900*              
018000 TERM SECTION.
018100*ACMCOMMENTSTART
018200     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
018300     DISPLAY   "INPUT-COUNT:" I-COUNTER.
018400     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
018500*ACMCOMMENTEND
018600     EXIT.
018700
