000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCC
000200*テストレコード
000300 01 I-RECORD.
000400   10 I-ID                  PIC  9(05).
000500   10 I-CD                  PIC  X(20).
000600   10 I-NIHONGO             PIC  X(20).
000700   10 I-SEISU               PIC  S9(07).
000800   10 I-HIZUKE.
000900     20 I-HIZUKE-YYYY       PIC  9(04).
001000     20 I-HIZUKE-MM         PIC  9(02).
001100     20 I-HIZUKE-DD         PIC  9(02).
001200   10 I-JIKOKU.
001300     20 I-JIKOKU-HH         PIC  9(02).
001400     20 I-JIKOKU-MM         PIC  9(02).
001500     20 I-JIKOKU-SS         PIC  9(02).
001600   10 I-JIKOKU-RED          REDEFINES I-JIKOKU.
001700     20 I-JIKOKU-RED1       PIC  X(06).
001800   10 I-FUDOU               PIC  S9(4)V9(3).
001900   10 I-OCCURS              OCCURS 2 TIMES.
002000     20 I-OCCURS-99         PIC  9(02).
002100     20 I-OCCURS-XX         PIC  X(02).
002200     20 I-OCCURS2           OCCURS 2 TIMES.
002300       25 I-OCCURS-SS       PIC  S9(02).
002400       25 I-OCCURS-FU       PIC  S9(4)V9(3).
002500   10 I-FUDOU2              PIC  S9(3)V9(3).
