000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000200*                      
000300*                    (SEQ)                        (SEQ)                  
000400 IDENTIFICATION              DIVISION.
000500 PROGRAM-ID.                 SEQTEST.
000600*AUTHOR.                     KENJI KIMURA.
000700 ENVIRONMENT                 DIVISION.
000800 CONFIGURATION               SECTION.
000900 INPUT-OUTPUT                SECTION.
001000 FILE-CONTROL.
001100*                        
001200*ACMFILE
001300*ACMRECNAME=I-RECORD
001400     SELECT INP-FILE ASSIGN TO "dbtests"
001500       ORGANIZATION LINE SEQUENTIAL.
001600 DATA                        DIVISION.
001700 FILE                        SECTION.
001800*                    
001900 FD  INP-FILE.
002000 COPY "I_RECORD.cbl".
002100 WORKING-STORAGE             SECTION.
002200 01  SOME-AREA.
002300     05  I-COUNTER           PIC 9(05).
002400     05  O-COUNTER           PIC 9(05).
002500     05  END-FLG             PIC 9(01)  VALUE  ZERO.
002600 01  OPTION-AREA.
002700     05  OPTIONVALUE         PIC X(10).
002800 01  LINK-AREA.
002900     02  X-COMMAND           PIC 9(1).
003000     02  X-RET               PIC 9(5).
003100 PROCEDURE                   DIVISION.
003200*              
003300 MAIN                        SECTION.
003400     PERFORM   INIT.
003500     PERFORM   FL-OPEN.
003600     PERFORM  INP-READ.
003700*                                                      
003800     PERFORM
003900        PERFORM  INP-READ
004000     END-PERFORM.
004100     PERFORM   FL-CLOSE.
004200     PERFORM   TERM.
004300     MOVE "TEST"   TO   OPTIONVALUE.
004400     DISPLAY OPTIONVALUE.
004500     STOP RUN.
004600*              
004700 INIT                        SECTION.
004800     DISPLAY   "PROGRAM STARTING.".
004900     EXIT.
005000*                      
005100 FL-OPEN                     SECTION.
005200     OPEN   INPUT  INP-FILE.
005300     EXIT.
005400*                  
005500 INP-READ                    SECTION.
005600*    CALL "SUBTEST" USING LINK-AREA.
005700*ACMCOMMENTSTART
005800     CALL "SUBTEST" USING LINK-AREA.
005900*ACMCOMMENTEND
006000*ACMINSERTSTART
006100*    CALL "pushJNIFileList" USING ACM-STATUS-ALL.
006200*    CALL "JNISUBTEST" USING LINK-AREA.
006300*    CALL "popJNIFileList" USING ACM-STATUS-ALL.
006400*ACMINSERTEND
006500     EXIT.
006600*                              
006700 FL-CLOSE                    SECTION.
006800     CLOSE  INP-FILE.
006900     EXIT.
007000*              
007100 TERM                        SECTION.
007200     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
007300     DISPLAY   "INPUT-COUNT:" I-COUNTER.
007400     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
007500     EXIT.
