000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000200*
000300*                    (SEQ)                        (SEQ)
000400 IDENTIFICATION              DIVISION.
000500 PROGRAM-ID.                 SEQTEST.
000600*AUTHOR.                     KENJI KIMURA.
000700 ENVIRONMENT                 DIVISION.
000800 CONFIGURATION               SECTION.
000900 INPUT-OUTPUT                SECTION.
001000 FILE-CONTROL.
001100*
001200*ACMFILE
001300*ACMASSIGNNAME=dbtests
001400*ACMRECNAME=I-RECORD
001500     SELECT INP-FILE ASSIGN TO "xxxxxx"
001600       ORGANIZATION LINE SEQUENTIAL.
001700 DATA                        DIVISION.
001800 FILE                        SECTION.
001900*
002000 FD  INP-FILE.
002100 COPY "I_RECORD.cbl".
002200 WORKING-STORAGE             SECTION.
002300 01  SOME-AREA.
002400     05  I-COUNTER           PIC 9(05).
002500     05  O-COUNTER           PIC 9(05).
002600     05  END-FLG             PIC 9(01)  VALUE  ZERO.
002700 01  OPTION-AREA.
002800     05  OPTIONVALUE         PIC X(10).
002900 PROCEDURE                   DIVISION.
003000*
003100 MAIN                        SECTION.
003200     PERFORM   INIT.
003300     PERFORM   FL-OPEN.
003400     PERFORM  INP-READ.
003500*
003600     PERFORM   UNTIL                                         END-F
003700-LG  NOT  =  ZERO
003800*                 OR  I-COUNTER     > 10000
003900        PERFORM  OUT-WRITE
004000        PERFORM  INP-READ
004100     END-PERFORM.
004200     PERFORM   FL-CLOSE.
004300     PERFORM   TERM.
004400     STOP RUN.
004500*
004600 INIT                        SECTION.
004700     DISPLAY   "PROGRAM STARTING.".
004800     EXIT.
004900*
005000 FL-OPEN                     SECTION.
005100     OPEN   INPUT                                            INP-F
005200-ILE.
005300     EXIT.
005400*
005500 INP-READ                    SECTION.
005600     READ INP-FILE NEXT
005700       AT END  MOVE 1 TO END-FLG
005800     END-READ.
005900     IF  END-FLG  =  ZERO
006000*
006100         ADD  1              TO  I-COUNTER
006200     END-IF.
006300     EXIT.
006400*
006500 OUT-WRITE                   SECTION.
006600     DISPLAY  I-RECORD.
006700     ADD  1                  TO  O-COUNTER.
006800     EXIT.
006900*
007000 FL-CLOSE                    SECTION.
007100     CLOSE  INP-FILE.
007200     EXIT.
007300*
007400 TERM                        SECTION.
007500     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
007600     DISPLAY   "INPUT-COUNT:" I-COUNTER.
007700     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
007800     EXIT.
