000100*AAAABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBCCCCCCCC
000200*サンプルプログラム
000300*入力ファイル(SEQ)→出力ファイル(SEQ)の転記処理
000400 IDENTIFICATION              DIVISION.
000500 PROGRAM-ID.                 SEQTEST.
000600*AUTHOR.                     KENJI KIMURA.
000700 ENVIRONMENT                 DIVISION.
000800 CONFIGURATION               SECTION.
000900 INPUT-OUTPUT                SECTION.
001000 FILE-CONTROL.
001100*    入力ファイル
001200*ACMFILE
001300*ACMRECNAME=I-RECORD
001400     SELECT INP-FILE ASSIGN TO "dbtests"
001500       ORGANIZATION LINE SEQUENTIAL.
001600 DATA                        DIVISION.
001700 FILE                        SECTION.
001800*入力ファイル
001900 FD  INP-FILE.
002000 COPY "I_RECORD.cbl".
002100 WORKING-STORAGE             SECTION.
002200 01  SOME-AREA.
002300     05  I-COUNTER           PIC 9(05).
002400     05  O-COUNTER           PIC 9(05).
002500     05  END-FLG             PIC 9(01)  VALUE  ZERO.
002600 01  OPTION-AREA.
002700     05  OPTIONVALUE         PIC X(10).
002800 PROCEDURE                   DIVISION.
002900*主処理節
003000 MAIN                        SECTION.
003100     PERFORM   INIT.
003200     PERFORM   FL-OPEN.
003300     PERFORM  INP-READ.
003400*    入力ファイルが終了するまで繰り返し
003500     PERFORM   UNTIL  END-FLG  NOT  =  ZERO
003600*                 OR  I-COUNTER     > 10000
003700        PERFORM  OUT-WRITE
003800        PERFORM  INP-READ
003900     END-PERFORM.
004000     PERFORM   FL-CLOSE.
004100     PERFORM   TERM.
004200     MOVE "TEST"   TO   OPTIONVALUE.
004300     DISPLAY OPTIONVALUE.
004400*ACMSETOPTION NAME="TEST" FROM=OPTIONVALUE.
004500     MOVE SPACE    TO   OPTIONVALUE.
004600*ACMGETOPTION NAME="TEST" TO=OPTIONVALUE.
004700     DISPLAY OPTIONVALUE.
004800*ACMSETOPTION NAME="TEST" VALUE="TSET".
004900     DISPLAY OPTIONVALUE.
004600*ACMGETOPTION NAME="TEST" TO=OPTIONVALUE.
004900     DISPLAY OPTIONVALUE.
005000     STOP RUN.
005100*開始処理
005200 INIT                        SECTION.
005300     DISPLAY   "PROGRAM STARTING.".
005400     EXIT.
005500*ファイルを開く節
005600 FL-OPEN                     SECTION.
005700     OPEN   INPUT  INP-FILE.
005800     EXIT.
005900*入力処理節
006000 INP-READ                    SECTION.
006100     READ INP-FILE NEXT
006200       AT END  MOVE 1 TO END-FLG
006300     END-READ.
006400     IF  END-FLG  =  ZERO
006500*        終端に達していなければカウンターを増分
006600         ADD  1              TO  I-COUNTER
006700     END-IF.
006800     EXIT.
006900*出力処理節
007000 OUT-WRITE                   SECTION.
007100     DISPLAY  I-RECORD.
007200     ADD  1                  TO  O-COUNTER.
007300     EXIT.
007400*ファイルを閉じる節
007500 FL-CLOSE                    SECTION.
007600     CLOSE  INP-FILE.
007700     EXIT.
007800*終了処理
007900 TERM                        SECTION.
008000     DISPLAY   "PROGRAM NORMALLY TERMINATED.".
008100     DISPLAY   "INPUT-COUNT:" I-COUNTER.
008200     DISPLAY   "OUTPUT-COUNT:" O-COUNTER.
008300     EXIT.
